app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)
    @item.user = current_user
    @item.expire_at = Time.now + 7.days

    if @item.save
---
INSERT INTO "items" ("name", "user_id", "expire_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Finish checkpoint 7"], ["user_id", 1], ["expire_at", "2016-05-31 00:11:28.478511"], ["created_at", "2016-05-24 00:11:28.479800"], ["updated_at", "2016-05-24 00:11:28.479800"]]

  def toggle
    @item = Item.find(params[:item_id])
    @item.complete = !@item.complete
    @item.save
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "items" SET "complete" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["complete", "t"], ["updated_at", "2016-05-24 00:21:19.194214"], ["id", 6]]

  def destroy
    @item = Item.find(params[:id])

    if @item.destroy
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 26]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 26]]